using System;

namespace H4
{
    class Program
    {
        static void Main(string[] args)
        {
           string[,] galaxi = {
                {"Меркурiй", "Найближча до Сонця планета Сонячної системи." },
                {"Венера", "Друга вiд Сонця та шоста за розмiром планета Сонячної системи." },
                {"Земля", "Третя вiд Сонця планета Сонячної системи, єдина планета, на якiй вiдоме життя, домiвка людства." }, 
                {"Марс", "Четверта планета Сонячної системи за вiдстанню вiд Сонця та сьома за розмiром i масою." }, 
                {"Юпiтер", "П'ята вiд Сонця та найбiльша планета Сонячної системи." }, 
                {"Сатурн", "Шоста за вiддаленiстю вiд Сонця та друга за розмiрами планета Сонячної системи." }, 
                {"Уран", "Сьома вiд Сонця велика планета Сонячної системи, належить до планет-гiгантiв." }, 
                {"Нептун","Планета Сонячної системи, восьма за вiддаленiстю вiд Сонця." },
                {"Плутон", "Найбiльша вiдома карликова планета Сонячної системи та найбiльший транснептуновий об'єкт, перший вiдкритий об'єкт поясу Койпера." } };

            int a = 1;

            while (Convert.ToBoolean(a))
            {
                Console.WriteLine("Введiть номер планети->");
                a = Convert.ToInt32(Console.ReadLine());

                Console.WriteLine(galaxi[a-1, 0]); 
                Console.WriteLine(galaxi[a-1, 1]);
            }
        }
    }
}
